/**********************************
程序：循环结构习题1
编者：bluix0
时间：2025.2.26
**********************************/
//题目：
//两个乒乓球队进行比赛，各出3人。
//甲队为 A,B,C 3人，乙队为 X,Y,Z 3人，已抽签决定比赛名单。
//有人向队员打听比赛的名单，
//A说他不和X比，C说他不和X,Z比，请编程序找出3对赛手的名单。

#include<stdio.h>
int main()
{
	for (int a='X';a <= 'Z';a++)
		for (int b='X';b <= 'Z';b++)
			for (int c='X';c <= 'Z';c++)
			{
				if (a == b || a == c || b == c||a=='X'||c=='X'||c=='Z')
					continue;
				printf("甲队A PK 乙队%c\n甲队B PK 乙队%c\n甲队C PK 乙队%c\n", a, b, c);
			}
}
